In [37]:
import pandas as pd

data = {
    "employee_id": [2, 3, 7, 8, 9],
    "name": ["Meir", "Michael", "Addilyn", "Juan", "Kannon"],
    "salary": [3000, 3800, 7400, 6100, 7700]
}

employees = pd.DataFrame(data)

employees

   employee_id     name  salary
0            2     Meir    3000
1            3  Michael    3800
2            7  Addilyn    7400
3            8     Juan    6100
4            9   Kannon    7700

In [38]:
employees["employee_id"] % 2

0    0
1    1
2    1
3    0
4    1
Name: employee_id, dtype: int64

In [39]:
employees["name"].str[0]

0    M
1    M
2    A
3    J
4    K
Name: name, dtype: object

In [41]:
employees[employees["employee_id"] % 2 == 1]

   employee_id     name  salary
1            3  Michael    3800
2            7  Addilyn    7400
4            9   Kannon    7700

In [42]:
employees[employees["name"].str[0] == "M"]

   employee_id     name  salary
0            2     Meir    3000
1            3  Michael    3800

employees["bonus"] = [employees["employee_id"] % 2 == 1]